Revit 2027 API
ProgressChangedEventArgs.Cancel Method
 Requests to cancel the progress bar's operation.
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void Cancel()
Public Sub Cancel
public:
void Cancel()
member Cancel : unit -> unit
Exceptions
Exception | Condition
InvalidOperationException |  The operation cannot be cancelled.
Remarks
 Note that an operation may only be cancelled if its stage is 'Unchanged' or if its stage is 'PositionChanged' and the 'Cancellable' property is 'true.'
See Also
Reference
ProgressChangedEventArgs Class
Autodesk.Revit.DB.Events Namespace